---
created: 2026-01-28T21:08:36 (UTC -05:00)
tags: []
source: https://help.autodesk.com/view/RVT/2023/ENU/?guid=Revit_API_Revit_API_Developers_Guide_Discipline_Specific_Functionality_MEP_Engineering_MEP_Fabrication_Detailing_html
author:
---

# Help | MEP Fabrication Detailing | Autodesk

> ## Excerpt
> Several Revit API classes work together to provide the ability to add fabrication components to a Revit document.

---
Several Revit API classes work together to provide the ability to add fabrication components to a Revit document.

## Fabrication detailing classes

Before you can place fabrication parts in an MEP model, you must specify a fabrication configuration and load fabrication services into the model. There are a number of classes in the Revit API to facilitate this process including:

-   **FabricationConfiguration** - Contains information about the fabrication configuration settings used by the project.
-   **FabricationConfigurationInfo** - Contains information about the properties of a FabricationConfiguration.
-   **ConfigurationReloadInfo** - Contains results from reloading a FabricationConfiguration.
-   **ConnectionValidationInfo** - Contains connection-related warnings generated by reloading a FabricationConfiguration.
-   **FabricationService** - Part of the fabrication configuration and defines what FabricationServiceButtons can be used.
-   **FabricationServiceButton** - Defines what items to use for different size-based conditions.
-   **FabricationPart** - Represents a fabrication component in Revit.
-   **FabricationPartType** - Defines the type of a FabricationPart.
-   **FabricationRodInfo** - Gives support rod information for a FabricationPart.
-   **FabricationHostedInfo** - Contains hosting information for a FabricationPart and provides the ability to disconnect from the host.
-   **FabricationConnectorInfo** - Contains information about the connectors of a FabricationPart.
-   **FabricationUtils** - General utility methods in the Autodesk Revit product for fabrication.
-   **FabricationDimensionDefinition** - Contains information about a fabrication dimension.

The primary classes involved in MEP Fabrication are covered in more detail below. Sample code can be found in the Revit SDK in the FabricationPartLayout sample.

## Fabrication configuration

Using the FabricationConfiguration class, users can get and set the fabrication configuration settings for the document. They can also load and unload services, reload the fabrication configuration, get loaded services, get fabrication specifications, get material and insulation information from the configuration, and get connector information.

There is only one fabrication configuration for the document and you can get it using the static FabricationConfiguration.GetFabricationConfiguration() method. To change the configuration, call the overloaded SetConfiguration() method, passing in a FabricationConfigurationInfo object which contains the information about the FabricationConfiguration. One overload of the SetConfiguration() method will set the configuration with the global profile, and one takes a profile name and sets the configuration with that specific profile. (The FabricationConfiguration.GetProfile() method returns the name of the current profile in use and the FabricationConfigurationInfo.GetProfiles() method returns all profile names associated with the configuration.)

The ReloadConfiguration() method reloads the fabrication configuration from its source fabrication configuration. This must be done prior to loading fabrication services.

Use the GetAllLoadedServices() method to get all loaded services or GetAllUsedServices() to get only used fabrication services. A service is in use if any fabrication part in the service is created by the user. Both methods return a list of FabricationService objects.

LoadServices() and UnloadServices() can be used to load and unload a list of fabrication services, respectively.

The FabricationConfiguration class also has methods to get configuration data abbreviations. The GetMaterialAbbreviation() returns the abbreviation of the material or the insulation or the double wall material. GetSpecificationAbbreviation() returns the specification abbreviation for the given specification and GetInsulationSpecificationAbbreviation() will return the abbreviation for the given insulation specification.

## Fabrication services

Fabrication services are part of the fabrication configuration and define what fabrication service buttons can be used. The PaletteCount property returns the number of palettes in the service. Using the index of the palettes, you can call GetPaletteName() to get the name of the palette. The method GetButtonCount() will return the number of buttons in a specified palette and the actual buttons can be retrieved by calling GetButton() with a specified palette index and button index.

### Fabrication service button

The FabricationServiceButton class contains information about a fabrication button. A fabrication service button defines an item that can be used to define a FabricationPart, possibly subject to a list of size-based specific conditions. Fabrication service buttons are part of a fabrication service.

## Fabrication parts

Using the FabricationPart class, users can create, place, move and align fabrication parts in a Revit model. Users can also get or set the dimensions of the fabrication part, and get the fabrication hosted information and support rod information.

The overloaded static FabricationPart.Create() method creates a new fabrication part based on a fabrication service button. The overloaded static CreateHanger() method creates a hanger on another fabrication part. The static AlignPartByConnectors() method will move and align a fabrication part by one of its connectors to align with another connector.

FabricationParts can also be created from design elements using the DesignToFabricationConverter class. The Convert() method will convert a set of MEP design elements into fabrication parts. Successfully created FabricationParts can be obtained using the GetConvertedFabricationParts() methods. If the Convert() method indicates a partial failure, the GetPartialConvertFailureResults() method will return a list of possible failures. For partial failure types (e.g. InvalidConnections) there is a corresponding method of the DesignToFabricationConverter class to retrieve a list of the ElementIds of the FabricationParts with that error type (e.g. GetConvertedFabricationPartsWithInvalidConnections()).

Methods also exist to get and set the value of the fabrication dimension, to get the host element information and to get the fabrication rod information. `FabricationPart.GetInsulationLiningGeometry()` returns any insulation or liner geometry for a fabrication part. If there is no insulation or liner applied the return value will be null.

### Connections and position

FabricationPart has a number of methods to attach to connectors or to change the position of the FabricationPart. The static StretchAndFit() method supports the operation to stretch the fabrication part from the specified connector and fit to the target routing end. The routing end is indicated as a FabricationPartRouteEnd object, which can be obtained from the static FabricationPartRouteEnd.CreateFromConnector() or FabricationPartRouteEnd.CreateFromCenterline() methods. If the StretchAndFit() method fails, it will return a FabricationPartFitResult enumeration that provides more details on the failure.

Other methods to modify the FabricationPart include Reposition(), RotateConnectedPartByConnector() and PlaceAsTap().

### Product lists

Some FabricationPart elements, such as purchased duct and pipe fittings, have a "product list". The product list entries represent a catalog of available sizes for the selected part. The ProductListEntry property specifies the product list entry of the FabricationPart. If the IsProductList() method returns false, the ProductListEntry will be -1.

To get the list of product entries for the FabricationPart, use the GetProductListEntryCount() and GetProductListEntryName() methods. Prior to changing the ProductListEntry for the FabricationPart, call IsProductListEntryCompatibleSize() to check to see if this part can be changed to the specified product list entry without altering any connected dimensions.

### Exporting fabrication job files

FabricationPart.SaveAsFabricationJob() writes a fabrication job to disk in the MAJ file format. The exported file will contain the fabrication parts included in the input. It takes an options class, FabricationSaveJobOptions, allowing for the possibility of including holes in fabrication parts where branches meet the main straight.

### Load and unload of one-off fabrication parts from loose item files

Autodesk.Revit.DB.FabricationItemFile contains information about one-off items that can be loaded into a fabrication configuration.

Autodesk.Revit.DB.FabricationItemFolder may contain nested FabricationItemFolders and a list of FabricationItemFiles.

The members:

-   FabricationConfiguration.LoadItemFiles()
-   FabricationConfiguration.UnloadItemFiles()
-   FabricationConfiguration.GetAllLoadedItemFiles()
-   FabricationConfiguration.GetAllUsedItemFiles()
-   FabricationConfiguration.CanUnloadItemFiles()
-   FabricationConfiguration.AreItemFilesLoaded()
-   FabricationConfiguration.GetItemFolders()

allow control over the loading and unloading of item files into the configuration.

FabricationPart.Create(Document, FabricationItemFile, ElementId) creates a FabricationPart from an item file.

### Version history of parts

Autodesk.Revit.DB.FabricationVersionInfo gives the information about differerent versions of fabrication data, including the reason why the data was changed.

FabricationPart.GetVersionHistory() returns a list of FabricationVersionInfo classes that describe the history of the changes made to the part. The most recent changes are first in the list.

### Part swap out information

Autodesk.Revit.DB.ReloadSwapOutInfo gives information about a part that was swapped out during reload.

The members:

-   ConfigurationReloadInfo.OutOfDatePartCount
-   ConfigurationReloadInfo.GetOutOfDatePartStatus()

identify the parts that had newer versions found during a reload and which Revit attempted to swap out.

### Centerline length

FabricationPart.CenterlineLength returns the length of the fabrication part's centerline.